<script setup></script>

<template>
  <main>
    <div class="flex justify-between">
      <div class="max-w-3xl">
        <h2 class="text-3xl pb-10 font-bold">Вкусные моменты для Вашей души!</h2>
        <p class="text-xl">
          Добро пожаловать в онлайн-магазин конфет и сладостей <b>Candify!</b><br> Здесь вы найдёте огромный
          выбор изысканных лакомств, которые порадуют вас своим вкусом и качеством. У нас
          представлены разнообразные конфеты, шоколад, мармелад, карамель и другие сладости от
          ведущих мировых производителей.
        </p>
        <p class="text-xl pt-5">
          В нашем магазине вы сможете найти уникальные и необычные сладости, которые станут отличным
          подарком для ваших друзей и близких. Мы предлагаем удобный и быстрый шопинг, а также
          быструю доставку заказов по всей стране.
        </p>
        <p class="text-xl pt-5 mb-10">
          Присоединяйтесь к сообществу любителей сладкого в Candify и наслаждайтесь лучшими 
          сладостями прямо у себя дома!
        </p>
        <RouterLink to="/shop"
          ><button class="bg-green-500 py-3 px-5 text-xl rounded-lg font-bold text-white">
            Перейти в магазин
          </button></RouterLink
        >
      </div>
      <div>
        <img src="/donuts.jpg" />
      </div>
    </div>
  </main>
</template>
